#include <stdio.h>

int main(void)
{
	int money;
	int a, b, c, d, e, f, g, h;
	printf("돈의 액수: ");
	scanf("%d", &money);
	a = money / 50000;
	b = (money % 50000) / 10000;
	c = ((money % 50000) % 10000) / 5000;
	d = (((money % 50000) % 10000) % 5000) / 1000;
	e = ((((money % 50000) % 10000) % 5000) % 1000) / 500;
	f = (((((money % 50000) % 10000) % 5000) % 1000) % 500) / 100;
	g = ((((((money % 50000) % 10000) % 5000) % 1000) % 500) % 100) / 50;
	h = (((((((money % 50000) % 10000) % 5000) % 1000) % 500) % 100) % 50) / 10;
	printf("%d원은 오만원권 %d매, 만원권 %d매, 오천원권 %d매, 천원권 %d매, 500원짜리 동전 %d개, 100원짜리 동전 %d개, 50원짜리 동전 %d개, 10원짜리 동전 %d개이다.\n", money, a, b, c, d, e, f, g, h);
	return 0;
}